open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_imx335.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_imx335.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.
 * The ASF licenses this file to you under the Apache License, Version
 * 2.0 (the "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.  See the License for the specific language governing
 * permissions and limitations under the License.
 *
 * STM32N6 IMX335 (Sony 5MP MIPI CSI-2) sensor driver.
 *
 * Ported from the ST BSP (SoftwarePackage/Drivers/BSP/IMX335/STM32_IMX335)
 * to NuttX:
 *   - Power-up sequence: PWDN=PG6, RST=PG4
 *   - I2C2 (PD4/PD14) with 16-bit register addressing, 7-bit addr 0x34
 *   - 2592x1944 RAW10 register tables + 37 MHz input clock + streaming
 *
 * The IMX335 is a streaming slave: once configured it continuously emits
 * RAW10 frames on MIPI CSI-2 (2 data lanes) without further host action.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/i2c/i2c_master.h>
#include <nuttx/arch.h>
#include <nuttx/clock.h>

#include "stm32n6_gpio.h"
#include "stm32n6_i2c.h"
#include "stm32n6_imx335.h"

#ifdef CONFIG_STM32_IMX335

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* IMX335 power/reset pins (ST BSP): PWDN=PG6, RST=PG4 */

#define IMX335_PWDN_GPIO   (GPIO_MODE_OUTPUT | GPIO_OTYPE_PP | \
                            GPIO_SPEED_HIGH | GPIO_PUPD_NONE | \
                            GPIO_PORTG | GPIO_PIN(6))
#define IMX335_RST_GPIO    (GPIO_MODE_OUTPUT | GPIO_OTYPE_PP | \
                            GPIO_SPEED_HIGH | GPIO_PUPD_NONE | \
                            GPIO_PORTG | GPIO_PIN(4))

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct regval
{
  uint16_t addr;
  uint8_t  val;
};

/* 16-bit value registers (e.g. IMX335 HS-timing TCLK_ZERO @0x3a1e) */

struct regval16
{
  uint16_t addr;
  uint16_t val;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* IMX335 2592x1944 resolution register table (ST BSP res_2592_1944_regs) */

static const struct regval g_res_2592_1944[] =
{
  {0x3000, 0x01},
  {0x3002, 0x00},
  {0x300c, 0x3b},
  {0x300d, 0x2a},
  {0x3018, 0x04},
  {0x302c, 0x3c},
  {0x302e, 0x20},
  {0x3056, 0x98},
  {0x3074, 0xc8},
  {0x3076, 0x30},
  {0x304c, 0x00},
  {0x314c, 0xc6},
  {0x315a, 0x02},
  {0x3168, 0xa0},
  {0x316a, 0x7e},
  {0x31a1, 0x00},
  {0x3288, 0x21},
  {0x328a, 0x02},
  {0x3414, 0x05},
  {0x3416, 0x18},
  {0x3648, 0x01},
  {0x364a, 0x04},
  {0x364c, 0x04},
  {0x3678, 0x01},
  {0x367c, 0x31},
  {0x367e, 0x31},
  {0x3706, 0x10},
  {0x3708, 0x03},
  {0x3714, 0x02},
  {0x3715, 0x02},
  {0x3716, 0x01},
  {0x3717, 0x03},
  {0x371c, 0x3d},
  {0x371d, 0x3f},
  {0x372c, 0x00},
  {0x372d, 0x00},
  {0x372e, 0x46},
  {0x372f, 0x00},
  {0x3730, 0x89},
  {0x3731, 0x00},
  {0x3732, 0x08},
  {0x3733, 0x01},
  {0x3734, 0xfe},
  {0x3735, 0x05},
  {0x3740, 0x02},
  {0x375d, 0x00},
  {0x375e, 0x00},
  {0x375f, 0x11},
  {0x3760, 0x01},
  {0x3768, 0x1b},
  {0x3769, 0x1b},
  {0x376a, 0x1b},
  {0x376b, 0x1b},
  {0x376c, 0x1a},
  {0x376d, 0x17},
  {0x376e, 0x0f},
  {0x3776, 0x00},
  {0x3777, 0x00},
  {0x3778, 0x46},
  {0x3779, 0x00},
  {0x377a, 0x89},
  {0x377b, 0x00},
  {0x377c, 0x08},
  {0x377d, 0x01},
  {0x377e, 0x23},
  {0x377f, 0x02},
  {0x3780, 0xd9},
  {0x3781, 0x03},
  {0x3782, 0xf5},
  {0x3783, 0x06},
  {0x3784, 0xa5},
  {0x3788, 0x0f},
  {0x378a, 0xd9},
  {0x378b, 0x03},
  {0x378c, 0xeb},
  {0x378d, 0x05},
  {0x378e, 0x87},
  {0x378f, 0x06},
  {0x3790, 0xf5},
  {0x3792, 0x43},
  {0x3794, 0x7a},
  {0x3796, 0xa1},
  {0x37b0, 0x36},
  {0x3a00, 0x01},
};

/* IMX335 2-lane 10-bit mode register table (ST BSP mode_2l_10b_regs) */

static const struct regval g_mode_2l_10b[] =
{
  {0x3050, 0x00},
  {0x319d, 0x00},
  {0x341c, 0xff},
  {0x341d, 0x01},
  {0x3a01, 0x01},
};

/* IMX335 37 MHz input clock register table (ST BSP inck_37Mhz_regs) */

static const struct regval g_inck_37mhz[] =
{
  {0x300c, 0x5b},
  {0x300d, 0x40},
  {0x314c, 0x80},
  {0x314d, 0x00},
  {0x315a, 0x02},
  {0x3168, 0x68},
  {0x316a, 0x7e},
};

/* IMX335 MIPI D-PHY HS transmit-timing registers (0x3a18-0x3a28) for
 * 1188 Mbps per-lane data rate.  Values taken from the Linux mainline
 * imx335 driver (drivers/media/i2c/imx335.c, mipi_data_rate_1188Mbps).
 * These timings depend only on the per-lane bit rate (1188 Mbps, from the
 * 37.125 MHz INCK PLL), not on the host OS.  NOTE: the rest of the Linux
 * table (BCWAIT/CPWAIT/INCKSEL1-4) corresponds to a 24 MHz INCK and MUST
 * NOT be copied - the ST BSP INCK37 table above is authoritative here.
 */

static const struct regval16 g_hs_timing_tclk[] =
{
  {0x3a18, 0x008f},   /* TCLK-POST */
  {0x3a1a, 0x004f},   /* TCLK-PREPARE */
  {0x3a1c, 0x0047},   /* TCLK-TRAIL */
  {0x3a1e, 0x0137},   /* TCLK-ZERO (16-bit) */
};

static const struct regval16 g_hs_timing_ths[] =
{
  {0x3a20, 0x004f},   /* THS-PREPARE */
  {0x3a22, 0x0087},   /* THS-ZERO */
  {0x3a24, 0x004f},   /* THS-TRAIL */
  {0x3a26, 0x007f},   /* THS-EXIT */
  {0x3a28, 0x003f},   /* T-LPX */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

