open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_imx335.c
static int imx335_write_reg(FAR struct i2c_master_s *i2c, uint16_t reg,
                            uint8_t val);
static int imx335_write_table(FAR struct i2c_master_s *i2c,
                              FAR const struct regval *regs,
                              uint32_t size);
static int imx335_write_reg16(FAR struct i2c_master_s *i2c, uint16_t reg,
                             uint16_t val);
static int imx335_write_table16(FAR struct i2c_master_s *i2c,
                                FAR const struct regval16 *regs,
                                uint32_t size);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static FAR struct i2c_master_s *g_i2c;

/* Runtime tuning overrides set through the helpers exported below.
 *
 * Every capture session pulses PWDN/RST and re-programs the register
 * tables, which resets whatever the operator tuned with imx335_tune.
 * stm32n6_imx335_configure() therefore re-applies any non-zero override
 * at its end, so the settings survive cam_save runs.  Zero means "keep
 * whatever the register tables programmed".
 */

static uint32_t g_tune_gain;   /* GAIN register value, 0.3 dB per step */
static uint32_t g_tune_shr0;   /* SHR0 integration length, in lines    */
static uint32_t g_tune_vmax;   /* VMAX frame length, in lines          */

/* configure() calls this to write the overrides above to the sensor */

int stm32n6_imx335_apply_tuning(void);

/* Runtime-selectable MIPI HS transmit-timing mode (see
 * stm32n6_imx335_set_hs_mode): 0=off, 1=TCLK only, 2=THS only, 3=full.
 */

/* MIPI HS transmit-timing mode for start_stream():
 *   0 = do not write HS timing regs (sensor defaults - matches bare-metal)
 *   1 = clock-lane group, 2 = data-lane group, 3 = both
 * Default 0: the HS timing values came from the Linux imx335 driver and
 * the bare-metal ST BSP (IMX335_SetFrequency) never programs them;
 * writing them disturbs the MIPI output timing (CSI ECC/SOT errors).
 */

static int g_imx335_hs_mode = 0;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imx335_write_reg
 *
 * Description:
 *   Write one byte to an IMX335 register (16-bit register address).
 *
 ****************************************************************************/

static int imx335_write_reg(FAR struct i2c_master_s *i2c, uint16_t reg,
                            uint8_t val)
{
  struct i2c_msg_s msg;
  uint8_t buf[3];

  buf[0] = (reg >> 8) & 0xff;
  buf[1] = reg & 0xff;
  buf[2] = val;

  msg.frequency = 100000;
  msg.addr      = IMX335_I2C_ADDR;
  msg.flags     = 0;
  msg.buffer    = buf;
  msg.length    = 3;

  return I2C_TRANSFER(i2c, &msg, 1);
}

/****************************************************************************
 * Name: imx335_write_table
 *
 * Description:
 *   Write a register value table to the IMX335.
 *
 ****************************************************************************/

static int imx335_write_table(FAR struct i2c_master_s *i2c,
                              FAR const struct regval *regs,
                              uint32_t size)
{
  uint32_t i;
  int ret;

  for (i = 0; i < size; i++)
    {
      ret = imx335_write_reg(i2c, regs[i].addr, regs[i].val);
      if (ret < 0)
        {
          _err("imx335: write reg 0x%04x failed: %d\n", regs[i].addr, ret);
          return ret;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: imx335_write_reg16
 *
 * Description:
 *   Write a 16-bit value to an IMX335 register (16-bit register address,
 *   little-endian 2-byte data, as used by the Sony MIPI HS-timing block).
 *
 ****************************************************************************/

static int imx335_write_reg16(FAR struct i2c_master_s *i2c, uint16_t reg,
                              uint16_t val)
{
  struct i2c_msg_s msg;
  uint8_t buf[4];

  buf[0] = (reg >> 8) & 0xff;
  buf[1] = reg & 0xff;
  buf[2] = val & 0xff;
  buf[3] = (val >> 8) & 0xff;

  msg.frequency = 100000;
  msg.addr      = IMX335_I2C_ADDR;
  msg.flags     = 0;
  msg.buffer    = buf;
  msg.length    = 4;

  return I2C_TRANSFER(i2c, &msg, 1);
}

/****************************************************************************
 * Name: imx335_write_table16
 *
 * Description:
 *   Write a 16-bit register value table to the IMX335.
 *
 ****************************************************************************/

static int imx335_write_table16(FAR struct i2c_master_s *i2c,
                                FAR const struct regval16 *regs,
                                uint32_t size)
{
  uint32_t i;
  int ret;

  for (i = 0; i < size; i++)
    {
      ret = imx335_write_reg16(i2c, regs[i].addr, regs[i].val);
      if (ret < 0)
        {
          _err("imx335: write16 reg 0x%04x failed: %d\n", regs[i].addr, ret);
          return ret;
        }
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_imx335_power_on
 *
 ****************************************************************************/

/* TEMPORARY PROBE (perf 2026): the camera start sequence costs 2620 ms per
 * frame and this function alone accounts for 1620 ms, yet its body asks for
 * only 200 + 3 ms.  Print every step with both the tick time and the DWT
 * cycle count; cycles/ms/1000 gives the real CPU frequency, which in turn
 * tells us whether CONFIG_BOARD_LOOPSPERMSEC is calibrated for this clock.
 * Remove once the delay source is identified. */

#define IMX335_DWT_CYCCNT 0xe0001004u
#define imx335_cyccnt()   (*(FAR volatile uint32_t *)IMX335_DWT_CYCCNT)

static void imx335_probe(FAR const char *name, FAR clock_t *t0,
                         FAR uint32_t *c0)
{
  clock_t  now = clock_systime_ticks();
  uint32_t c1  = imx335_cyccnt();
  uint32_t ms  = (uint32_t)TICK2MSEC(now - *t0);
  uint32_t cyc = c1 - *c0;

  _info("imx335 step: %-12s %5lu ms %10lu cyc %s%lu MHz\n", name,
        (unsigned long)ms, (unsigned long)cyc, ms > 0 ? "" : "  ",
        ms > 0 ? (unsigned long)(cyc / ms / 1000) : 0);

