open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_imx335.c
  *t0 = now;
  *c0 = c1;
}

int stm32n6_imx335_power_on(void)
{
  /* PWDN high, RST low, wait 200 ms, then RST high */

  clock_t  t0 = clock_systime_ticks();
  uint32_t c0 = imx335_cyccnt();

  stm32n6_configgpio(IMX335_RST_GPIO);
  imx335_probe("cfg RST", &t0, &c0);

  stm32n6_configgpio(IMX335_PWDN_GPIO);
  imx335_probe("cfg PWDN", &t0, &c0);

  stm32n6_gpiowrite(IMX335_PWDN_GPIO, true);
  imx335_probe("wr PWDN=1", &t0, &c0);

  stm32n6_gpiowrite(IMX335_RST_GPIO, false);
  imx335_probe("wr RST=0", &t0, &c0);

  up_mdelay(200);
  imx335_probe("mdelay200", &t0, &c0);

  stm32n6_gpiowrite(IMX335_RST_GPIO, true);
  imx335_probe("wr RST=1", &t0, &c0);

  up_mdelay(3);
  imx335_probe("mdelay3", &t0, &c0);

  _info("imx335: power-on done (PWDN=PG6 RST=PG4)\n");

  return OK;
}

/****************************************************************************
 * Name: stm32n6_imx335_init
 *
 ****************************************************************************/

int stm32n6_imx335_configure(void)
{
  uint8_t id;
  int ret;

  /* Open I2C2 (PD4=SDA / PD14=SCL, AF4) */

  g_i2c = stm32n6_i2cbus_initialize(2);
  if (g_i2c == NULL)
    {
      _err("imx335: I2C2 init failed\n");
      return -ENODEV;
    }

  /* Check the sensor ID */

  ret = stm32n6_imx335_read_reg(IMX335_REG_ID, &id);
  if (ret < 0)
    {
      _err("imx335: read ID failed: %d\n", ret);
      return ret;
    }

  if (id != IMX335_ID)
    {
      _err("imx335: unexpected ID 0x%02x (expected 0x%02x)\n",
           id, IMX335_ID);
      return -ENODEV;
    }

  _info("imx335: ID=0x%02x OK\n", id);

  /* Program the resolution table */

  ret = imx335_write_table(g_i2c, g_res_2592_1944,
                           sizeof(g_res_2592_1944) /
                           sizeof(g_res_2592_1944[0]));
  if (ret < 0)
    {
      return ret;
    }

  /* Program the 2-lane 10-bit mode */

  ret = imx335_write_table(g_i2c, g_mode_2l_10b,
                           sizeof(g_mode_2l_10b) /
                           sizeof(g_mode_2l_10b[0]));
  if (ret < 0)
    {
      return ret;
    }

  /* --- Readback verification: confirm the I2C writes took effect ---
   * (before streaming -- I2C hangs once the sensor streams for a while)
   */

  static const uint16_t verify_regs[] =
  {
    0x300c, 0x3a00, 0x3a01, 0x3912
  };

  static const uint8_t expect[] =
  {
    0x3b, 0x01, 0x01, 0x00
  };

  uint8_t v;
  int i;

  for (i = 0; i < (int)(sizeof(verify_regs) / sizeof(verify_regs[0])); i++)
    {
      ret = stm32n6_imx335_read_reg(verify_regs[i], &v);
      if (ret < 0)
        {
          _err("imx335: readback reg 0x%04x failed: %d\n",
               verify_regs[i], ret);
        }
      else
        {
          _info("imx335: readback 0x%04x=0x%02x (expect 0x%02x)%s\n",
                verify_regs[i], v, expect[i],
                (v == expect[i]) ? " OK" : "  <<< MISMATCH");
        }
    }

  /* Default analogue gain.  The ST BSP register tables never program the
   * gain, so the sensor comes out of reset at 0 dB and every capture was
   * severely underexposed (measured mean luma 26/255).  24 dB was measured
   * as the best setting for the eye-tracking captures (mean 103/255 with no
   * highlight clipping).  imx335_tune can still override this at run time -
   * the override is re-applied immediately below.
   */

  ret = stm32n6_imx335_write_reg(0x30e8, 80);   /* 24 dB = 80 x 0.3 dB */

  if (ret < 0)
    {
      _err("imx335: default gain write failed: %d\n", ret);
    }

  /* Re-apply any runtime exposure/gain override (see g_tune_* above).
   *
   * The operator tunes these with imx335_tune and they would otherwise be
   * lost every time a capture session pulses PWDN/RST and reloads the
   * register tables.
   */

  if (stm32n6_imx335_apply_tuning() < 0)
    {
      _err("imx335: applying tuning overrides failed\n");
    }

  _info("imx335: configured (2592x1944 RAW10, 2-lane)\n");
  return OK;
}

/****************************************************************************
 * Name: stm32n6_imx335_set_gain / set_exposure / set_vmax / apply_tuning
 *
 * Description:
 *   Tuning helpers used by apps/examples/imx335_tune.  The setters only
 *   record the requested value; apply_tuning() writes the recorded values
 *   to the sensor and is called from stm32n6_imx335_configure(), so the
 *   settings survive the reset that each capture run performs.
 *
 ****************************************************************************/

void stm32n6_imx335_set_gain(uint32_t gain)
{
  g_tune_gain = gain;
}

void stm32n6_imx335_set_exposure(uint32_t shr0)
{
  g_tune_shr0 = shr0;
}

void stm32n6_imx335_set_vmax(uint32_t vmax)
{
  g_tune_vmax = vmax;
}

int stm32n6_imx335_apply_tuning(void)
{
  static const uint16_t gain_reg[2] =
  {
    0x30e8, 0x30e9
  };

  static const uint16_t shr0_reg[3] =
  {
    0x3058, 0x3059, 0x305a
  };

  static const uint16_t vmax_reg[3] =
  {
    0x3030, 0x3031, 0x3032
  };

  uint32_t val;
  int i;
  int ret;

  if (g_i2c == NULL)
    {
      return -ENODEV;
    }

  if (g_tune_vmax != 0)
    {
      for (i = 0, val = g_tune_vmax; i < 3; i++, val >>= 8)
        {
          ret = stm32n6_imx335_write_reg(vmax_reg[i],
                                          (uint8_t)(val & 0xff));
          if (ret < 0)
            {
              return ret;
            }
        }
    }

  if (g_tune_shr0 != 0)
    {
      for (i = 0, val = g_tune_shr0; i < 3; i++, val >>= 8)
        {
          ret = stm32n6_imx335_write_reg(shr0_reg[i],
                                          (uint8_t)(val & 0xff));
          if (ret < 0)
            {
              return ret;
            }
        }
    }

  if (g_tune_gain != 0)
    {
      /* IMX335 keeps the whole 0..72 dB range in the single byte at
       * gain_reg[0] (0x30e8, 0.3 dB per step - see IMX335_REG_GAIN in the
       * ST BSP).  The previous two-byte sequence split the value across the
       * wrong registers, so every configure() reset the gain back to 0 dB.
       */

      ret = stm32n6_imx335_write_reg(gain_reg[0], (uint8_t)g_tune_gain);
      if (ret < 0)
        {
          return ret;
        }
    }

  if (g_tune_gain != 0 || g_tune_shr0 != 0 || g_tune_vmax != 0)
    {
      _info("imx335: tuning reapplied (gain=0x%03lx shr0=%lu vmax=%lu)\n",
            (unsigned long)g_tune_gain, (unsigned long)g_tune_shr0,
            (unsigned long)g_tune_vmax);
    }

  return OK;
}

int stm32n6_imx335_start_stream(void)
{
  int ret;

  /* Start streaming (mode select = streaming) - the ALIENTEK IMX335_Init
   * writes the mode select BEFORE the input-clock (INCK) table; the INCK
   * PLL programming only takes effect once the sensor is out of standby.
   */

  ret = imx335_write_reg(g_i2c, IMX335_REG_MODE_SELECT,
                            IMX335_MODE_STREAMING);
  if (ret < 0)
    {
      return ret;
    }

