open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_imx335.c
  up_mdelay(20);

  /* Write the input-clock (INCK) PLL table.  The bare-metal ALIENTEK
   * demo calls IMX335_SetFrequency(IMX335_INCK_37MHZ) after the mode
   * select, programming the sensor PLL for a 37.125 MHz input clock
   * (0x300c=0x5B, 0x300d=0x40).  A previous appli.hex disassembly
   * mis-read SetFrequency(5) as an empty 6 MHz table; 5 is actually
   * IMX335_INCK_37MHZ (INCK_6MHZ is 0), so the INCK table MUST be
   * written for the MIPI output bitrate to match the DCMIPP PHY.
   */

  ret = imx335_write_table(g_i2c, g_inck_37mhz,
                           sizeof(g_inck_37mhz) /
                           sizeof(g_inck_37mhz[0]));
  if (ret < 0)
    {
      return ret;
    }

  if (g_imx335_hs_mode == 1 || g_imx335_hs_mode == 3)
    {
      ret = imx335_write_table16(g_i2c, g_hs_timing_tclk,
                                 sizeof(g_hs_timing_tclk) /
                                 sizeof(g_hs_timing_tclk[0]));
      if (ret < 0)
        {
          return ret;
        }
    }

  if (g_imx335_hs_mode == 2 || g_imx335_hs_mode == 3)
    {
      ret = imx335_write_table16(g_i2c, g_hs_timing_ths,
                                 sizeof(g_hs_timing_ths) /
                                 sizeof(g_hs_timing_ths[0]));
      if (ret < 0)
        {
          return ret;
        }
    }

  up_mdelay(20);

  /* DIAG (2026-08-25): verify the INCK PLL table actually took effect.
   * If the sensor PLL is not programmed, the MIPI output rate will not
   * match the DCMIPP PHY and the link never syncs (CRC errors).
   */

  uint8_t v;

  if (stm32n6_imx335_read_reg(0x300c, &v) == 0)
    {
      _info("imx335: INCK readback 0x300c=0x%02x (expect 0x5b)\n", v);
    }

  if (stm32n6_imx335_read_reg(0x300d, &v) == 0)
    {
      _info("imx335: INCK readback 0x300d=0x%02x (expect 0x40)\n", v);
    }

  if (stm32n6_imx335_read_reg(0x314c, &v) == 0)
    {
      _info("imx335: INCK readback 0x314c=0x%02x (expect 0x80)\n", v);
    }

  _info("imx335: streaming started"
        " (INCK 37MHz + HS timing mode %d written)\n", g_imx335_hs_mode);

  return OK;
}

/****************************************************************************
 * Name: stm32n6_imx335_set_hs_mode
 *
 * Description:
 *   Select the MIPI D-PHY HS transmit-timing mode for the next
 *   stm32n6_imx335_start_stream():
 *     0 = do not write any HS timing registers (sensor defaults,
 *         matches bare-metal diag9f; this is the default)
 *     1 = write clock-lane group only (0x3a18-0x3a1e)
 *     2 = write data-lane group only (0x3a20-0x3a28)
 *     3 = write both groups
 *
 ****************************************************************************/

void stm32n6_imx335_set_hs_mode(int mode)
{
  g_imx335_hs_mode = mode;
}

int stm32n6_imx335_get_hs_mode(void)
{
  return g_imx335_hs_mode;
}

/****************************************************************************
 * Name: stm32n6_imx335_read_reg
 *
 * Description:
 *   Read one byte from an IMX335 register (16-bit register address).
 *   Requires the sensor to have been initialized (I2C bus open).
 *
 ****************************************************************************/

int stm32n6_imx335_read_reg(uint16_t reg, FAR uint8_t *val)
{
  struct i2c_msg_s msg;
  uint8_t regbuf[2];
  int ret;

  if (g_i2c == NULL)
    {
      return -ENODEV;
    }

  regbuf[0] = (reg >> 8) & 0xff;
  regbuf[1] = reg & 0xff;

  /* Write the register address with a STOP (separate transfer), then read
   * the data with a fresh START.  The IMX335 on this board does not
   * tolerate a repeated-START read (NACK / garbage), so split the two
   * phases into independent transfers.
   */

  msg.frequency = 100000;
  msg.addr      = IMX335_I2C_ADDR;
  msg.flags     = 0;
  msg.buffer    = regbuf;
  msg.length    = 2;

  ret = I2C_TRANSFER(g_i2c, &msg, 1);
  if (ret < 0)
    {
      _err("imx335: read reg 0x%04x addr wr failed: %d\n", reg, ret);
      return ret;
    }

  msg.flags     = I2C_M_READ;
  msg.buffer    = val;
  msg.length    = 1;

  ret = I2C_TRANSFER(g_i2c, &msg, 1);
  if (ret < 0)
    {
      _err("imx335: read reg 0x%04x data rd failed: %d\n", reg, ret);
      return ret;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_imx335_write_reg
 *
 * Description:
 *   Write one byte to an IMX335 register (16-bit register address).
 *   Requires the sensor to have been initialized (I2C bus open).
 *
 ****************************************************************************/

int stm32n6_imx335_write_reg(uint16_t reg, uint8_t val)
{
  struct i2c_msg_s msg;
  uint8_t buf[3];
  int ret;

  if (g_i2c == NULL)
    {
      return -ENODEV;
    }

  buf[0] = (reg >> 8) & 0xff;
  buf[1] = reg & 0xff;
  buf[2] = val;

  msg.frequency = 100000;
  msg.addr      = IMX335_I2C_ADDR;
  msg.flags     = 0;
  msg.buffer    = buf;
  msg.length    = 3;

  ret = I2C_TRANSFER(g_i2c, &msg, 1);
  if (ret < 0)
    {
      _err("imx335: write reg 0x%04x failed: %d\n", reg, ret);
      return ret;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_imx335_read_reg_8bit
 *
 * Description:
 *   Diagnostic: read one byte using 8-bit register addressing (single
 *   address byte).  Used to determine whether the IMX335 on this board
 *   uses 8-bit or 16-bit register addressing.
 *
 ****************************************************************************/

int stm32n6_imx335_read_reg_8bit(uint8_t reg, FAR uint8_t *val)
{
  struct i2c_msg_s msg[2];
  uint8_t regbuf[1];
  int ret;

  if (g_i2c == NULL)
    {
      return -ENODEV;
    }

  regbuf[0] = reg;

  msg[0].frequency = 100000;
  msg[0].addr      = IMX335_I2C_ADDR;
  msg[0].flags     = 0;
  msg[0].buffer    = regbuf;
  msg[0].length    = 1;

  msg[1].frequency = 100000;
  msg[1].addr      = IMX335_I2C_ADDR;
  msg[1].flags     = I2C_M_READ;
  msg[1].buffer    = val;
  msg[1].length    = 1;

  ret = I2C_TRANSFER(g_i2c, msg, 2);
  if (ret < 0)
    {
      _err("imx335: 8-bit read reg 0x%02x failed: %d\n", reg, ret);
      return ret;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_imx335_write_reg_8bit
 *
 * Description:
 *   Diagnostic: write one byte using 8-bit register addressing (single
 *   address byte + data byte).
 *
 ****************************************************************************/

