open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_imx335.c
int stm32n6_imx335_write_reg_8bit(uint8_t reg, uint8_t val)
{
  struct i2c_msg_s msg;
  uint8_t buf[2];
  int ret;

  if (g_i2c == NULL)
    {
      return -ENODEV;
    }

  buf[0] = reg;
  buf[1] = val;

  msg.frequency = 100000;
  msg.addr      = IMX335_I2C_ADDR;
  msg.flags     = 0;
  msg.buffer    = buf;
  msg.length    = 2;

  ret = I2C_TRANSFER(g_i2c, &msg, 1);
  if (ret < 0)
    {
      _err("imx335: 8-bit write reg 0x%02x failed: %d\n", reg, ret);
      return ret;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_imx335_i2c_scan
 *
 * Description:
 *   Diagnostic: scan the I2C2 bus (7-bit addresses 0x08..0x77) and report
 *   which devices ACK.  Determines whether the IMX335 (0x34) is really
 *   connected to the bus.
 *
 ****************************************************************************/

int stm32n6_imx335_i2c_scan(void)
{
  struct i2c_msg_s msg;
  uint8_t dummy;
  int addr;
  int found;

  if (g_i2c == NULL)
    {
      return -ENODEV;
    }

  found = 0;

  for (addr = 0x08; addr < 0x78; addr++)
    {
      dummy = 0;

      msg.frequency = 100000;
      msg.addr      = addr;
      msg.flags     = 0;
      msg.buffer    = &dummy;
      msg.length    = 1;

      if (I2C_TRANSFER(g_i2c, &msg, 1) == 1)
        {
          _info("imx335: I2C device found at 0x%02x\n", addr);
          found++;
        }
    }

  _info("imx335: I2C scan done, %d device(s) found\n", found);

  return found;
}

/****************************************************************************
 * Name: stm32n6_imx335_read_reg_at
 *
 * Description:
 *   Diagnostic: read one byte from an IMX335-style register using an
 *   arbitrary 7-bit I2C address.  Used to probe which address the IMX335
 *   really answers on (0x34 vs 0x1a, per the I2C bus scan).
 *
 ****************************************************************************/

int stm32n6_imx335_read_reg_at(uint16_t i2c_addr, uint16_t reg,
                               FAR uint8_t *val)
{
  struct i2c_msg_s msg[2];
  uint8_t regbuf[2];
  int ret;

  if (g_i2c == NULL)
    {
      return -ENODEV;
    }

  regbuf[0] = (reg >> 8) & 0xff;
  regbuf[1] = reg & 0xff;

  msg[0].frequency = 100000;
  msg[0].addr      = i2c_addr;
  msg[0].flags     = 0;
  msg[0].buffer    = regbuf;
  msg[0].length    = 2;

  msg[1].frequency = 100000;
  msg[1].addr      = i2c_addr;
  msg[1].flags     = I2C_M_READ;
  msg[1].buffer    = val;
  msg[1].length    = 1;

  ret = I2C_TRANSFER(g_i2c, msg, 2);
  return ret;
}

#endif /* CONFIG_STM32_IMX335 */
